app/views/tasks/_task_list.html.haml

INSERT INTO "tasks" ("completed", "created_at", "note", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", "2015-02-16"], ["created_at", "2015-02-16 11:26:16.981632"], ["note", "Validation test"], ["title", "Vlidation"], ["updated_at", "2015-02-16 11:26:16.981632"]]
---
            %strong= task.title
          %td.text-info= task.created_at