app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("completed", "created_at", "note", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", "2015-02-16"], ["created_at", "2015-02-16 11:26:16.981632"], ["note", "Validation test"], ["title", "Vlidation"], ["updated_at", "2015-02-16 11:26:16.981632"]]
---
        def create
        	@task = Task.create(task_params)

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]
---
        def destroy
        	@task = Task.find(params[:id])
        	authorize! :destroy, @task
        	@task.destroy

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
---
        def edit
        	@task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
---
        def update
        	@task = Task.find(params[:id])